import React from 'react';

const Description = () => {
    return (
        <div className="col-xs-12 col-md-6">
            <h2>Как проходит мастер-класс <br/> бачаты для двоих?</h2>
            <ul>
                <li>Клиентов ждет индивидуальный урок по изучению движений доминиканского танца.
                </li>
                <li>Тренер составит программу мастер-класса в зависимости от навыков пары. Занятие
                    включает
                    разминку и освоение элементов стиля.
                </li>
                <li>Под руководством хореографа новички отработают основные шаги и повороты, а затем
                    попробуют соединить все движения в одну последовательную композицию.
                </li>
                <li>До конца урока ученики разучат мини-связку из 5-6 восьмерок. Более опытные
                    танцоры
                    смогут улучшить свои навыки и отработать новые элементы.
                </li>
            </ul>
        </div>
    );
};

export default Description;