import React from 'react';

const Faq = () => {
    return (
        <section id="faq" className="faq">
            <div className="container">
                <h2>Вопрос-ответ</h2>
                <div className="faqblock">
                    <div className="head">
                        <p className="title">
                            <img src="img/icons/faq.svg" alt="?"/>
                            Какая
                            длительность бачата
                            для двоих?</p>
                        <button>
                            <span>Раскрыть</span>
                            <svg width="11" height="6" viewBox="0 0 11 6" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M6.37911e-08 1.05606C6.72902e-08 0.784876 0.115759 0.524119 0.335701 0.315515C0.787161 -0.0912652 1.52802 -0.0912652 1.97948 0.315515L5.49855 3.47588L9.01763 0.305084C9.46909 -0.101695 10.2099 -0.101695 10.6614 0.305084C11.1129 0.711864 11.1129 1.3794 10.6614 1.78618L6.32044 5.69752C6.1005 5.8957 5.8111 6 5.49855 6C5.186 6 4.89661 5.88527 4.67666 5.69752L0.335701 1.79661C0.115759 1.58801 6.04266e-08 1.31682 6.37911e-08 1.05606Z"
                                    fill="#FF6B45"/>
                            </svg>
                        </button>
                    </div>
                    <div className="answer">Традиция дарить друг другу подарки существует с незапамятных времен.
                        В разные
                        эпохи этот ритуал проходил по своим правилам, которые из века в век менялись,
                        совершенствовались. Еще несколько столетий назад преподношение даров виновнику праздника
                        представляло собой пышную церемонию с реверансами, пафосными речами и настоящим
                        соревнованием –
                        чей подарок дороже, красивее, экзотичнее
                    </div>
                </div>
                <div className="faqblock">
                    <div className="head">
                        <p className="title">
                            <img src="img/icons/faq.svg" alt="?"/>
                            Сколько
                            человек может
                            участвовать?</p>
                        <button><span>Раскрыть</span>
                            <svg width="11" height="6" viewBox="0 0 11 6" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M6.37911e-08 1.05606C6.72902e-08 0.784876 0.115759 0.524119 0.335701 0.315515C0.787161 -0.0912652 1.52802 -0.0912652 1.97948 0.315515L5.49855 3.47588L9.01763 0.305084C9.46909 -0.101695 10.2099 -0.101695 10.6614 0.305084C11.1129 0.711864 11.1129 1.3794 10.6614 1.78618L6.32044 5.69752C6.1005 5.8957 5.8111 6 5.49855 6C5.186 6 4.89661 5.88527 4.67666 5.69752L0.335701 1.79661C0.115759 1.58801 6.04266e-08 1.31682 6.37911e-08 1.05606Z"
                                    fill="#FF6B45"/>
                            </svg>
                        </button>
                    </div>
                    <div className="answer">Традиция дарить друг другу подарки существует с незапамятных времен.
                        В разные
                        эпохи этот ритуал проходил по своим правилам, которые из века в век менялись,
                        совершенствовались. Еще несколько столетий назад преподношение даров виновнику праздника
                        представляло собой пышную церемонию с реверансами, пафосными речами и настоящим
                        соревнованием –
                        чей подарок дороже, красивее, экзотичнее
                    </div>
                </div>
                <div className="faqblock">
                    <div className="head">
                        <p className="title">
                            <img src="img/icons/faq.svg" alt="?"/>
                            Сколько раз
                            купили?
                        </p>
                        <button><span>Раскрыть</span>
                            <svg width="11" height="6" viewBox="0 0 11 6" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M6.37911e-08 1.05606C6.72902e-08 0.784876 0.115759 0.524119 0.335701 0.315515C0.787161 -0.0912652 1.52802 -0.0912652 1.97948 0.315515L5.49855 3.47588L9.01763 0.305084C9.46909 -0.101695 10.2099 -0.101695 10.6614 0.305084C11.1129 0.711864 11.1129 1.3794 10.6614 1.78618L6.32044 5.69752C6.1005 5.8957 5.8111 6 5.49855 6C5.186 6 4.89661 5.88527 4.67666 5.69752L0.335701 1.79661C0.115759 1.58801 6.04266e-08 1.31682 6.37911e-08 1.05606Z"
                                    fill="#FF6B45"/>
                            </svg>
                        </button>
                    </div>
                    <div className="answer">Традиция дарить друг другу подарки существует с незапамятных времен.
                        В разные
                        эпохи этот ритуал проходил по своим правилам, которые из века в век менялись,
                        совершенствовались. Еще несколько столетий назад преподношение даров виновнику праздника
                        представляло собой пышную церемонию с реверансами, пафосными речами и настоящим
                        соревнованием –
                        чей подарок дороже, красивее, экзотичнее
                    </div>
                </div>
            </div>
        </section>

    );
};

export default Faq;