import React from 'react';

const PostAuthor = () => {
    return (
        <section id="post" className="post">
            <div className="container">
                <div className="author">
                    <div className="img">
                        <img src="img/postauthor.png" alt="Катерина Геляева"/>
                    </div>
                    <div className="info">
                        <p className="name">Катерина Геляева</p>
                        <p className="sub">Консультант по впечатлениям</p>
                    </div>
                </div>
                <div id="content1" className="textafter">
                    <p>С другой стороны реализация намеченных плановых заданий
                        способствует подготовки и реализации позиций, занимаемых участниками в отношении
                        поставленных
                        задач.
                        <br/><br/>
                        Повседневная практика показывает, что консультация с широким активом обеспечивает
                        широкому
                        кругу (специалистов) участие в формировании соответствующий условий активизации.
                        <br/><br/>
                        Повседневная практика показывает, что постоянный количественный рост и сфера нашей
                        активности влечет за собой процесс внедрения и модернизации системы обучения кадров,
                        соответствует насущным потребностям.
                        <br/><br/>
                        Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности
                        позволяет выполнять важные задания по разработке направлений прогрессивного
                        развития. <br/>
                        Разнообразный и богатый опыт начало повседневной работы по формированию позиции
                        играет важную роль в формировании дальнейших направлений развития.</p></div>
            </div>
        </section>

    );
};

export default PostAuthor;